# Pr√°tica de uso de arquivos CSV, TSV, Planilha e do Pandas

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('veiculos.csv')
df

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900.0
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799.0

In [3]:
df['Year'] == 1999

0    False
1     True
2     True
3    False
Name: Year, dtype: bool

In [4]:
df_1999 = df[df['Year'] == 1999]
df_1999

   Year   Make                                   Model Description   Price
1  1999  Chevy              Venture "Extended Edition"         NaN  4900.0
2  1999  Chevy  Venture "Extended Edition, Very Large"         NaN  5000.0

In [5]:
df_1999.to_csv('veiculos_1999.csv', index=False)

In [6]:
df.to_csv('veiculos.tsv', index=False, sep='\t')

In [7]:
with open('veiculos.csv') as f:
    doc = f.read()
print(doc)

Year,Make,Model,Description,Price
1997,Ford,E350,"ac, abs, moon",3000.00
1999,Chevy,"Venture ""Extended Edition""","",4900.00
1999,Chevy,"Venture ""Extended Edition, Very Large""",,5000.00
1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799.00

In [8]:
with open('veiculos.csv', 'a') as f:
    f.write('2024,Toyota,Corolla,Red,100000.00\n')

In [9]:
df = pd.read_csv('veiculos.csv')
df

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900.0
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799.0
4,2024,Toyota,Corolla,Red,100000.0

In [10]:
df.to_excel('veiculos.xlsx', index=False)

In [11]:
df = pd.read_excel('veiculos.xlsx')
df

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000
3,1996,Jeep,Grand Cherokee,"MUST SELL! air, moon roof, loaded",4799
4,2024,Toyota,Corolla,Red,100000

In [12]:
df.head(2)

   Year   Make                       Model    Description  Price
0  1997   Ford                        E350  ac, abs, moon   3000
1  1999  Chevy  Venture "Extended Edition"            NaN   4900

In [13]:
df.tail(2)

   Year    Make           Model                        Description   Price
3  1996    Jeep  Grand Cherokee  MUST SELL! air, moon roof, loaded    4799
4  2024  Toyota         Corolla                                Red  100000